use std::io;

// Програма, която чете от стандартния вход редове,
// съдържащи числа, разделени с интервал, и ги принтира.
//
// Забележка: този код съдържа доста конструкции, за които не сме
// говорили в детайли - итератори, шаблонни функции, съпоставяне на
// образци.

fn main() {
    let mut result = vec![];

    let stdin = io::stdin();
    let mut buf = String::new();
    loop {
        buf.clear();

        // Прочитаме един ред от стандартния вход, записвайки резултата в буфера `buf`.
        let read_result = stdin.read_line(&mut buf);

        // Четенето от терминала може да върне грешка, за която трябва да проверим.
        // Използваме факта, че `match` конструкцията е израз, за да разопаковаме резултата.
        // Ако е `Ok(n)`, стойността на `match` израза ще е `n`, което приствояваме на променливата `bytes_read`.
        // Ако е `Err(e)`, няма стойност, защото `break` директно излиза от цикъла.
        let bytes_read = match read_result {
            Ok(n) => n,
            Err(e) => {
                println!("грешка при четене: {}", e);
                break;
            }
        };

        // Взимаме резен към прочетените байтове.
        // От тук нататък няма да алокираме повече памет, ще работим
        // само с референции към части от буфера.
        // `line` е от тип `&str`.
        //
        // Понеже изчистваме буфера при всяка итератация на цикъла,
        // `..bytes_read` всъщност ще ни даде цялото съдържание на низа.
        // Т.е. в случая е еквиваленто на `&buf[..]` или `buf.as_str()`.
        let line = &buf[..bytes_read];

        // Изтриваме символа за нов ред от края на низа (както и всички
        // други whitespace символи от началото или края на низа).
        // trim: fn(&str)->&str
        let line = line.trim();

        // `split` ни връща итератор по отделните части от низа, разделени с
        // интервал. `elem` е от тип `&str`.
        for elem in line.split(' ') {
            // Опитваме се да конвертираме думата до цяло число.
            // Ако не успеем, просто я игнорираме.
            match elem.parse::<i32>() {
                Ok(num) => {
                    result.push(num);
                }
                Err(_) => continue,
            }
        }

        println!("числата до сега: {:?}", result);
    }
}
